ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G003/N32G003.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>BEEPER</name>
            <description>Beeper unit</description>
            <groupName>BEEPER</groupName>
            <baseAddress>0x40003800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>BEEPER_CTRL</name>
                    <displayName>BEEPER_CTRL</displayName>
                    <description>BEEPER_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>BEEPER_EN</name>
                            <description>BEEPER_EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEEPER_INV_EN</name>
                            <description>BEEPER_INV_EN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEEPER_FREQ_SEL</name>
                            <description>BEEPER_FREQ_SEL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

        <peripheral>
            <name>COMP</name>
            <description>comparator</description>
            <groupName>COMP</groupName>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>COMP</name>
                <description>COMP global interrupt</description>
                <value>15</value>
            </interrupt>
            <registers>
                <register>
                    <name>COMP_INTEN</name>
                    <displayName>COMP_INTEN</displayName>
                    <description>COMP_INTEN</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>CMPIEN</name>
                            <description>CMPIEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_INTSTS</name>
                    <displayName>COMP_INTSTS</displayName>
                    <description>COMP_INTSTS</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>CMPIS</name>
                            <description>CMPIS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_LOCK</name>
                    <displayName>COMP_LOCK</displayName>
                    <description>COMP_LOCK</description>
                    <addressOffset>0x0c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>CMPLK</name>
                            <description>CMPLK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_CTRL</name>
                    <displayName>COMP_CTRL</displayName>
                    <description>COMP_CTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0003ff9f</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMPVOS</name>
                            <description>CMPVOS</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OUTTRG</name>
                            <description>OUTTRG</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_FILC</name>
                    <displayName>COMP_FILC</displayName>
                    <description>COMP_FILC</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_FILP</name>
                    <displayName>COMP_FILP</displayName>
                    <description>COMP_FILP</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
