ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G003/N32G003.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>CRC</name>
            <description>cyclic redundancy check</description>
            <groupName>CRC</groupName>
            <baseAddress>0x40023000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CRC16CTRL</name>
                    <displayName>CRC16CTRL</displayName>
                    <description>CRC16CTRL</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>ENDHL</name>
                            <description>ENDHL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR</name>
                            <description>CLR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC16DAT</name>
                    <displayName>CRC16DAT</displayName>
                    <description>CRC16DAT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>CRC16DAT</name>
                            <description>CRC16DAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC16D</name>
                    <displayName>CRC16D</displayName>
                    <description>CRC16D</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CRC16D</name>
                            <description>CRC16D</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRC</name>
                    <displayName>LRC</displayName>
                    <description>LRC</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>LRCDAT</name>
                            <description>LRCDAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
       
        <peripheral>
            <name>EXTI</name>
            <description>external interrupt/event controller</description>
            <groupName>EXTI</groupName>
            <baseAddress>0x40003400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EXTI0_1</name>
                <description>EXTI0/1 interrupt</description>
                <value>2</value>
            </interrupt>
            <interrupt>
                <name>EXTI2_3</name>
                <description>EXTI2/3 interrupt</description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>EXTI4_17</name>
                <description>EXTI4/5/6/7/8/9/10/11/12/13/14/15/16/17 interrupt</description>
                <value>4</value>
            </interrupt>           
            <registers>
                <register>
                    <name>EXTI_IMASK</name>
                    <displayName>EXTI_IMASK</displayName>
                    <description>EXTI_IMASK</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>IMASK</name>
                            <description>IMASK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_EMASK</name>
                    <displayName>EXTI_EMASK</displayName>
                    <description>EXTI_EMASK</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>EMASK</name>
                            <description>EMASK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_RT_CFG</name>
                    <displayName>EXTI_RT_CFG</displayName>
                    <description>EXTI_RT_CFG</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>RT_CFG</name>
                            <description>RT_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_FT_CFG</name>
                    <displayName>EXTI_FT_CFG</displayName>
                    <description>EXTI_FT_CFG</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>FT_CFG</name>
                            <description>FT_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_SWIE</name>
                    <displayName>EXTI_SWIE</displayName>
                    <description>EXTI_SWIE</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>SWIE</name>
                            <description>SWIE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTI_PEND</name>
                    <displayName>EXTI_PEND</displayName>
                    <description>EXTI_PEND</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>PEND</name>
                            <description>PEND</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                        </field>               
                    </fields>
                </register>
