ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G003/N32G003.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>FLASH</name>
            <description>interal FLASH controller</description>
            <groupName>FLASH</groupName>
            <baseAddress>0x40022000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FLASH</name>
                <description>FLASH global interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>FLASH_AC</name>
                    <displayName>FLASH_AC</displayName>
                    <description>FLASH_AC</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000030</resetValue>
                    <resetMask>0x00000033</resetMask>
                    <fields>
                        <field>
                            <name>LATENCY</name>
                            <description>LATENCY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PRFTBFE</name>
                            <description>PRFTBFE</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRFTBFS</name>
                            <description>PRFTBFS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_KEY</name>
                    <displayName>FLASH_KEY</displayName>
                    <description>FLASH_KEY</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FKEY</name>
                            <description>FKEY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_OPTKEY</name>
                    <displayName>FLASH_OPTKEY</displayName>
                    <description>FLASH_OPTKEY</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>OPTKEY</name>
                            <description>OPTKEY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_STS</name>
                    <displayName>FLASH_STS</displayName>
                    <description>FLASH_STS</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PGERR</name>
                            <description>PGERR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRPERR</name>
                            <description>WRPERR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOP</name>
                            <description>EOP</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPRERR</name>
                            <description>SPRERR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFGERR</name>
                            <description>CFGERR</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_CTRL</name>
                    <displayName>FLASH_CTRL</displayName>
                    <description>FLASH_CTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <resetMask>0x000017f7</resetMask>
                    <fields>
                        <field>
                            <name>PG</name>
                            <description>PG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PER</name>
                            <description>PER</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MER</name>
                            <description>MER</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OPTPG</name>
                            <description>OPTPG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OPTER</name>
                            <description>OPTER</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>START</name>
                            <description>START</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>LOCK</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>MMER</name>
                            <description>MMER</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OPTWE</name>
                            <description>OPTWE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRITE</name>
                            <description>ERRITE</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOPITE</name>
                            <description>EOPITE</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_ADD</name>
                    <displayName>FLASH_ADD</displayName>
                    <description>FLASH_ADD</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FADD</name>
                            <description>FADD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_OB</name>
                    <displayName>FLASH_OB</displayName>
                    <description>FLASH_OB</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x03fffffc</resetValue>
                    <resetMask>0x83fffc7f</resetMask>
                    <fields>
                        <field>
                            <name>OBERR</name>
                            <description>OBERR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDPRT1</name>
                            <description>RDPRT1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDG_SW</name>
                            <description>WDG_SW</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>nRST_STOP</name>
                            <description>nRST_STOP</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>nRST_PD</name>
                            <description>nRST_PD</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOOT_LOCK</name>
                            <description>BOOT_LOCK</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NRST_PA0</name>
                            <description>NRST_PA0</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Data0</name>
                            <description>Data0</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>Data1</name>
                            <description>Data1</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>RDPRT2</name>
                            <description>RDPRT2</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_USER</name>
                    <displayName>FLASH_USER</displayName>
                    <description>FLASH_USER</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0x00ff3fff</resetMask>
                    <fields>
                        <field>
                            <name>LVRCNT</name>
                            <description>LVRCNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
						<field>
                            <name>LVRLS</name>
                            <description>LVRLS</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
						<field>
                            <name>LVREN</name>
                            <description>LVREN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>LVRFILEN</name>
                            <description>LVRFILEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>POR_DELAY</name>
                            <description>POR_DELAY</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
						<field>
                            <name>LVRRSTEN</name>
                            <description>LVRRSTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_VTOR</name>
                    <displayName>FLASH_VTOR</displayName>
                    <description>FLASH_VTOR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>VTOR_VALUE</name>
                            <description>VTOR_VALUE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
						<field>
                            <name>VTOR_EN</name>
                            <description>VTOR_EN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
