ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G003/N32G003.svd
            </registers>	
        </peripheral>

        <peripheral>
            <name>RCC</name>
            <description>Reset and clock control</description>
            <groupName>RCC</groupName>
            <baseAddress>0x40021000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>RCC_HSICTRL</name>
                    <displayName>RCC_HSICTRL</displayName>
                    <description>RCC_HSICTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000082</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>HSI40MRDF</name>
                            <description>HSI40MRDF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI48MRDF</name>
                            <description>HSI48MRDF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSITRIM</name>
                            <description>HSITRIM</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG</name>
                    <displayName>RCC_CFG</displayName>
                    <description>RCC_CFG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x20003000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AHBPRES</name>
                            <description>AHBPRES</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>APBPRES</name>
                            <description>APBPRES</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SYSPRES</name>
                            <description>SYSPRES</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCO</name>
                            <description>MCO</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCOPRES</name>
                            <description>MCOPRES</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_PRST</name>
                    <displayName>RCC_PRST</displayName>
                    <description>RCC_PRST</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007fff</resetMask>
                    <fields>
                        <field>
                            <name>AFIORST</name>
                            <description>AFIORST</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEEPERRST</name>
                            <description>BEEPERRST</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPARST</name>
                            <description>IOPARST</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPBRST</name>
                            <description>IOPBRST</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART1RST</name>
                            <description>UART1RST</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2RST</name>
                            <description>UART2RST</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CRST</name>
                            <description>I2CRST</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRRST</name>
                            <description>PWRRST</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCRST</name>
                            <description>ADCRST</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPIRST</name>
                            <description>SPIRST</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1RST</name>
                            <description>TIM1RST</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3RST</name>
                            <description>TIM3RST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM6RST</name>
                            <description>TIM6RST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMPRST</name>
                            <description>COMPRST</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_AHBPCLKEN</name>
                    <displayName>RCC_AHBPCLKEN</displayName>
                    <description>RCC_AHBPCLKEN</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001040</resetMask>
                    <fields>						
                        <field>
                            <name>CRCEN</name>
                            <description>CRCEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCEN</name>
                            <description>ADCEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_APBPCLKEN</name>
                    <displayName>RCC_APBPCLKEN</displayName>
                    <description>RCC_APBPCLKEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00004200</resetValue>
                    <resetMask>0x00007fff</resetMask>
                    <fields>
                        <field>
                            <name>AFIOEN</name>
                            <description>AFIOEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEEPEREN</name>
                            <description>BEEPEREN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPAEN</name>
                            <description>IOPAEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPBEN</name>
                            <description>IOPBEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMPEN</name>
                            <description>COMPEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMPFILTEN</name>
                            <description>COMPFILTEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>UART1EN</name>
                            <description>UART1EN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2EN</name>
                            <description>UART2EN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CEN</name>
                            <description>I2CEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWREN</name>
                            <description>PWREN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPIEN</name>
                            <description>SPIEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1EN</name>
                            <description>TIM1EN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3EN</name>
                            <description>TIM3EN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM6EN</name>
                            <description>TIM6EN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGEN</name>
                            <description>IWDGEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_LSICTRL</name>
                    <displayName>RCC_LSICTRL</displayName>
                    <description>RCC_LSICTRL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000042</resetValue>
                    <resetMask>0x01ffffff</resetMask>
                    <fields>
                        <field>
                            <name>LSIRDF</name>
                            <description>LSIRDF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSITRIM</name>
                            <description>LSITRIM</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>LSIDETEN</name>
                            <description>LSIDETEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>LSIFREQ</name>
                            <description>LSIFREQ</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>LSIDETFF</name>
                            <description>LSIDETFF</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CTRLSTS</name>
                    <displayName>RCC_CTRLSTS</displayName>
                    <description>RCC_CTRLSTS</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000018</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>RMRSTF</name>
                            <description>RMRSTF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PINRSTF</name>
                            <description>PINRSTF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PORRSTF</name>
                            <description>PORRSTF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SFTRSTF</name>
                            <description>SFTRSTF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGRSTF</name>
                            <description>IWDGRSTF</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LVRRSTF</name>
                            <description>LVRRSTF</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPWRRSTF</name>
                            <description>LPWRRSTF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMCRSTF</name>
                            <description>EMCRSTF</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG2</name>
                    <displayName>RCC_CFG2</displayName>
                    <description>RCC_CFG2</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000c01</resetValue>
                    <resetMask>0xc0000c0f</resetMask>
                    <fields>
                        <field>
                            <name>ADCPRES</name>
                            <description>ADCPRES</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADC1MPRES</name>
                            <description>ADC1MPRES</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TIM6CLKSEL</name>
                            <description>TIM6CLKSEL</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TIM1CLKSEL</name>
                            <description>TIM1CLKSEL</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>RCC_EMCCTRL</name>
                    <displayName>RCC_EMCCTRL</displayName>
                    <description>RCC_EMCCTRL</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001001</resetMask>
                    <fields>
                        <field>
                            <name>EMCDETEN</name>
                            <description>EMCDETEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMCRSTEN</name>
                            <description>EMCRSTEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
