ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G003/N32G003.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>UART1</name>
            <description>Universal asynchronous receiver transmitter</description>
            <groupName>UART</groupName>
            <baseAddress>0x40004400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>UART1</name>
                <description>UART1 global interrupt</description>
                <value>13</value>
            </interrupt>
            <registers>
                <register>
                    <name>UART_STS</name>
                    <displayName>UART_STS</displayName>
                    <description>UART_STS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000c0</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>PEF</name>
                            <description>PEF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEF</name>
                            <description>FEF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NEF</name>
                            <description>NEF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OREF</name>
                            <description>OREF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDLEF</name>
                            <description>IDLEF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDNE</name>
                            <description>RXDNE</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXC</name>
                            <description>TXC</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDE</name>
                            <description>TXDE</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_DAT</name>
                    <displayName>UART_DAT</displayName>
                    <description>UART_DAT</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000001ff</resetMask>
                    <fields>
                        <field>
                            <name>DATV</name>
                            <description>DATV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_BRCF</name>
                    <displayName>UART_BRCF</displayName>
                    <description>UART_BRCF</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>DIV_Decimal</name>
                            <description>DIV_Decimal</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DIV_Integer</name>
                            <description>DIV_Integer</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_CTRL1</name>
                    <displayName>UART_CTRL1</displayName>
                    <description>UART_CTRL1</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003fff</resetMask>
                    <fields>
                        <field>
                            <name>SDBRK</name>
                            <description>SDBRK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RCVWU</name>
                            <description>RCVWU</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXEN</name>
                            <description>RXEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEN</name>
                            <description>TXEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IDLEIEN</name>
                            <description>IDLEIEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDNEIEN</name>
                            <description>RXDNEIEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIEN</name>
                            <description>TXCIEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDEIEN</name>
                            <description>TXDEIEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEIEN</name>
                            <description>PEIEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PSEL</name>
                            <description>PSEL</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCEN</name>
                            <description>PCEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUM</name>
                            <description>WUM</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WL</name>
                            <description>WL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>UEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_CTRL2</name>
                    <displayName>UART_CTRL2</displayName>
                    <description>UART_CTRL2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003fff</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>ADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>STPB</name>
                            <description>STPB</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_CTRL3</name>
                    <displayName>UART_CTRL3</displayName>
                    <description>UART_CTRL3</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000f</resetMask>
                    <fields>
                        <field>
                            <name>HDMEN</name>
                            <description>HDMEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART2</name>
            <baseAddress>0x40004800</baseAddress>   
            <interrupt>
                <name>UART2</name>
                <description>UART2 global interrupt</description>
                <value>14</value>
            </interrupt>         
        </peripheral>
       
    </peripherals>
</device>
